**Table of contents**<a id='toc0_'></a>    
- [Import Statements](#toc1_1_)    
- [Mathematical operations on DataFrames](#toc2_)    

<!-- vscode-jupyter-toc-config
	numbering=false
	anchor=true
	flat=false
	minLevel=2
	maxLevel=5
	/vscode-jupyter-toc-config -->
<!-- THIS CELL WILL BE REPLACED ON TOC UPDATE. DO NOT WRITE YOUR TEXT IN THIS CELL -->

**Read the official documentation on pandas DataFrames @ https://pandas.pydata.org/pandas-docs/stable/reference/frame.html**

**`Note:`** The notion of **chaining functions/methods** in pandas is similar to python.

DataFrames are **column oriented** unlike most common databases. And, **each column** in the dataframe is a **pandas series object**. So, any operation that can be performed on a pandas series object can be applied to a column too.

There are **two axes** for a dataframe commonly referred to as axis 0 and 1, or the **"index"** (or 'rows') axis and the **"columns"** axis respectively. Note that, when an **operation** is applied **along axis 0**, it is applied **down through all the rows for all the columns**. Likewise, operations **along axis 1** is applied **across the values in all the columns for all of the rows**.

### <a id='toc1_1_'></a>[Import Statements](#toc0_)

In [1]:
# import statements
import numpy as np
import pandas as pd

In [2]:
# view options
pd.set_option("display.max_columns", 14)
pd.set_option("display.max_rows", 8)

---------------

## <a id='toc2_'></a>[Mathematical operations on DataFrames](#toc0_)

----------------

**Similar to series objects, Math operations for DataFrames are Index Aligned. What's more is that they are Columns Aligned too.**

Aligning will take each index entry from a particular column in the left df and match it up with every entry with the same index and column name of the right df. This is repeated for all the overlapping columns. If any of the df has duplicate index this will cause the addition operation to behave unexpectedly i.e, it will work by process of permutating the matching indexex.

In [3]:
# df1: 3 rows and 4 columns
# df2: 2 rows and 5 columns
df1 = pd.DataFrame(
    np.linspace(2, 13, 12).reshape(3, 4),
    columns=["a1", "b1", "c1", "d1"],
    index=[1, 2, 3],
)
df2 = pd.DataFrame(
    np.linspace(2, 11, 10).reshape(2, 5),
    columns=["a1", "b1", "c1", "d1", "e1"],
    index=[2, 2],
)

In [4]:
df1

     a1    b1    c1    d1
1   2.0   3.0   4.0   5.0
2   6.0   7.0   8.0   9.0
3  10.0  11.0  12.0  13.0

In [5]:
df2

    a1   b1   c1    d1    e1
2  2.0  3.0  4.0   5.0   6.0
2  7.0  8.0  9.0  10.0  11.0

In [6]:
df1 + df2

     a1    b1    c1    d1  e1
1   NaN   NaN   NaN   NaN NaN
2   8.0  10.0  12.0  14.0 NaN
2  13.0  15.0  17.0  19.0 NaN
3   NaN   NaN   NaN   NaN NaN

As we can see, only the **overlapping rows** (2nd row) **and columns** (a1 through d1) get added together. The other values are missing. We can use the **.add method instead of  "+"  and define a fill value** if we wanted, similar to what we've done in case of series objects.

In [7]:
df1.add(df2, fill_value=0)

     a1    b1    c1    d1    e1
1   2.0   3.0   4.0   5.0   NaN
2   8.0  10.0  12.0  14.0   6.0
2  13.0  15.0  17.0  19.0  11.0
3  10.0  11.0  12.0  13.0   NaN

> Some of the available operator methods are, 
    
    add(), sub(), mul(), div(), mod(), pow(), rfloordiv(), lt(), gt(), eq(), ne(), le(), ge(), dot(), product() etc.

**`Note`**: *If the dataframes have a multi-level index, we can specify the level for the division using the **level** parameter*